app/views/questions/_question.html.erb

SELECT "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT ?  [["LIMIT", 1]]
---

<% elsif question.author_name == current_user.username && current_user.present?%>