app/views/users/show.html.erb

      <div class="questions-wrap mt-8">
        <h2 class="text-lg font-semibold text-gray-900 dark:text-white">Количество: <%= @user.questions.size %> <%= declination_by_numbers(@user.questions.size, "Вопрос", "Вопроса", "Вопросов") %> </h2>
---
SELECT "questions".* FROM "questions" WHERE "questions"."user_id" = ?  [["user_id", 7]]
SELECT COUNT(*) FROM "questions" WHERE "questions"."user_id" = ?  [["user_id", 7]]