app/controllers/questions_controller.rb

SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "questions" SET "text" = ?, "updated_at" = ? WHERE "questions"."id" = ?  [["text", "фыввв"], ["updated_at", "2023-09-19 19:51:04.548377"], ["id", 5]]
---
  def update
    @question = Question.find(params[:id])

    if @question.update(question_update_params)

INSERT INTO "questions" ("text", "created_at", "updated_at", "user_id", "author_name") VALUES (?, ?, ?, ?, ?)  [["text", "Че ты"], ["created_at", "2023-09-09 22:13:46.110060"], ["updated_at", "2023-09-09 22:13:46.110060"], ["user_id", 10], ["author_name", "@mathey"]]
---
  def create
    @question = Question.new(question_params)
    #QuestionManager::QuestionCreator.call(question_params)

    if @question.save