app/controllers/users_controller.rb

  def index
    @users = User.all
---
SELECT "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT ?  [["LIMIT", 1]]

  def create
    redirect_to root_url, alert: 'Вы уже залогинены' if current_user.present?

    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("name", "username", "created_at", "updated_at", "email", "password_hash", "password_salt", "slug") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    if @user.update(update_user_params)
---
UPDATE "users" SET "updated_at" = ?, "avatar_url" = ? WHERE "users"."id" = ?  [["updated_at", "2023-08-31 00:26:18.167654"], ["avatar_url", "https://images.genius.com/1e414dd702bf0c26ca4d255d0bf7d3a0.1000x1000x1.jpg"], ["id", 8]]

  def load_user
    @user ||= User.friendly.find params[:id]
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]