app/models/user.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "math@mail.ru"], ["LIMIT", 1]]
---
  def self.authenticate(email, password)
    user = User.find_by(email: email)